; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 5327)
	(= (fuel plane1) 533)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city0)
	(= (capacity plane2) 2618)
	(= (fuel plane2) 463)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at person1 city1)
	(at person2 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 932)
	(= (distance city0 city2) 783)
	(= (distance city0 city3) 816)
	(= (distance city0 city4) 509)
	(= (distance city1 city0) 932)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 761)
	(= (distance city1 city3) 914)
	(= (distance city1 city4) 707)
	(= (distance city2 city0) 783)
	(= (distance city2 city1) 761)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 730)
	(= (distance city2 city4) 593)
	(= (distance city3 city0) 816)
	(= (distance city3 city1) 914)
	(= (distance city3 city2) 730)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 664)
	(= (distance city4 city0) 509)
	(= (distance city4 city1) 707)
	(= (distance city4 city2) 593)
	(= (distance city4 city3) 664)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city4)
	(at person1 city2)
	(at person2 city1)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane2 city0)
   changed: (fuel plane2) from 463 to 2618
   goals met: 0 of 3
2. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 509, (fuel plane2) from 2618 to 2109
   goals met: 1 of 3
3. (board person2 plane2 city4)
   deleted: (at person2 city4)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 3
4. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 509 to 1216, (fuel plane2) from 2109 to 1402
   goals met: 0 of 3
5. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 1 of 3
6. (board person1 plane2 city1)
   deleted: (at person1 city1)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 3
7. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 1216 to 1977, (fuel plane2) from 1402 to 641
   goals met: 1 of 3
8. (debark person1 plane2 city2)
   deleted: (in person1 plane2)
   added: (at person1 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 3
9. (fly plane2 city2 city4)
   deleted: (at plane2 city2)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 1977 to 2570, (fuel plane2) from 641 to 48
   goals met: 3 of 3
